@echo off
chcp 65001 >nul
title سرور هوش مصنوعی و وب سپهریار

echo ========================================================
echo        راه‌اندازی سرور وب هوش مصنوعی سپهریار
echo ========================================================
echo.
echo در حال اجرای سرور وب روی پورت 8080...
echo.
echo [کامپیوتر]: http://127.0.0.1:8080
echo [گوشی موبایل]: http://192.168.10.190:8080 (اتصال از طریق وای‌فای)
echo.
echo ========================================================
echo در حال باز کردن مرورگر در کامپیوتر...
start "" "http://127.0.0.1:8080"
echo.
py run.py --server --port 8080
pause
